Revit 2027 API
FaceEdgeNode Properties
The FaceEdgeNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LineProperties |  Access to the line (pen) properties of the curve being drawn.
(Inherited from FaceDetailNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
See Also
Reference
FaceEdgeNode Class
Autodesk.Revit.DB Namespace